-- phpMyAdmin SQL Dump
-- version 5.2.1
-- https://www.phpmyadmin.net/
--
-- Host: localhost
-- Generation Time: Aug 06, 2025 at 05:21 AM
-- Server version: 10.6.19-MariaDB
-- PHP Version: 8.0.30

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- Database: `primacom_Customer`
--

-- --------------------------------------------------------

--
-- Table structure for table `orders`
--

CREATE TABLE `orders` (
  `order_id` int(11) NOT NULL,
  `order_number` varchar(50) NOT NULL,
  `customer_id` int(11) NOT NULL,
  `created_by` int(11) NOT NULL,
  `order_date` date NOT NULL,
  `total_amount` decimal(12,2) NOT NULL,
  `discount_amount` decimal(10,2) DEFAULT 0.00,
  `discount_percentage` decimal(5,2) DEFAULT 0.00,
  `net_amount` decimal(12,2) NOT NULL,
  `payment_method` enum('cash','transfer','cod','credit','other') DEFAULT 'cash',
  `payment_status` enum('pending','paid','partial','cancelled') DEFAULT 'pending',
  `delivery_date` date DEFAULT NULL,
  `delivery_address` text DEFAULT NULL,
  `delivery_status` enum('pending','shipped','delivered','cancelled') DEFAULT 'pending',
  `notes` text DEFAULT NULL,
  `is_active` tinyint(1) DEFAULT 1,
  `created_at` timestamp NOT NULL DEFAULT current_timestamp(),
  `updated_at` timestamp NOT NULL DEFAULT current_timestamp() ON UPDATE current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Dumping data for table `orders`
--

INSERT INTO `orders` (`order_id`, `order_number`, `customer_id`, `created_by`, `order_date`, `total_amount`, `discount_amount`, `discount_percentage`, `net_amount`, `payment_method`, `payment_status`, `delivery_date`, `delivery_address`, `delivery_status`, `notes`, `is_active`, `created_at`, `updated_at`) VALUES
(13, 'ORD20250803D8F695', 1, 1, '2025-08-03', 100.00, 0.00, 0.00, 100.00, 'cod', 'paid', NULL, 'Test Address', 'pending', 'Test order', 1, '2025-08-03 09:29:29', '2025-08-03 09:41:53'),
(14, 'ORD20250803F92373', 1, 1, '2025-08-03', 100.00, 0.00, 0.00, 100.00, 'cod', 'pending', NULL, 'Test Address', 'pending', 'Test order', 1, '2025-08-03 09:30:47', '2025-08-03 09:30:47'),
(15, 'ORD20250803A214EB', 4, 1, '2025-08-03', 450.00, 0.00, 0.00, 450.00, 'cod', 'paid', '2025-08-14', '321 ถนนเพชรบุรี', 'pending', '555', 1, '2025-08-03 09:33:22', '2025-08-03 09:33:22'),
(16, 'ORD2025080362976A', 4, 1, '2025-08-03', 450.00, 0.00, 0.00, 450.00, 'cod', 'paid', '2025-08-14', '321 ถนนเพชรบุรี', 'pending', '555', 1, '2025-08-03 09:34:12', '2025-08-03 09:34:12'),
(17, 'ORD202508037E9FFC', 4, 1, '2025-08-03', 450.00, 0.00, 0.00, 450.00, 'cod', 'paid', '2025-08-14', '321 ถนนเพชรบุรี', 'pending', '555', 1, '2025-08-03 09:35:02', '2025-08-03 09:35:02'),
(18, 'ORD202508039CA40F', 1, 1, '2025-08-03', 100.00, 0.00, 0.00, 100.00, 'cod', 'pending', NULL, 'Test Address', 'pending', 'Test order', 1, '2025-08-03 09:35:18', '2025-08-03 09:35:18'),
(20, 'ORD20250803389C62', 1, 1, '2025-08-03', 100.00, 0.00, 0.00, 100.00, 'cod', 'pending', NULL, 'Test Address', 'pending', 'Test order', 1, '2025-08-03 09:35:32', '2025-08-03 09:35:32'),
(21, 'ORD20250803C2B2B7', 4, 1, '2025-08-03', 450.00, 0.00, 0.00, 450.00, 'cod', 'paid', '2025-08-14', '321 ถนนเพชรบุรี', 'pending', '555', 1, '2025-08-03 09:35:52', '2025-08-03 09:35:52'),
(22, 'ORD20250803604933', 4, 1, '2025-08-03', 450.00, 0.00, 0.00, 450.00, 'cod', 'paid', '2025-08-14', '321 ถนนเพชรบุรี', 'pending', '555', 1, '2025-08-03 09:36:42', '2025-08-03 09:36:42'),
(23, 'ORD2025080341DFA0', 4, 1, '2025-08-03', 450.00, 0.00, 0.00, 450.00, 'cod', 'paid', '2025-08-14', '321 ถนนเพชรบุรี', 'pending', '555', 1, '2025-08-03 09:37:32', '2025-08-03 09:37:32'),
(24, 'ORD20250803889D05', 4, 1, '2025-08-03', 450.00, 0.00, 0.00, 450.00, 'cod', 'paid', '2025-08-14', '321 ถนนเพชรบุรี', 'pending', '555', 1, '2025-08-03 09:38:22', '2025-08-03 09:38:22'),
(25, 'ORD20250803196D0C', 4, 1, '2025-08-03', 450.00, 0.00, 0.00, 450.00, 'cod', 'paid', '2025-08-14', '321 ถนนเพชรบุรี', 'pending', '555', 1, '2025-08-03 09:39:12', '2025-08-03 09:39:12'),
(26, 'ORD20250803BEE348', 4, 1, '2025-08-03', 450.00, 0.00, 0.00, 450.00, 'cod', 'paid', '2025-08-14', '321 ถนนเพชรบุรี', 'pending', '555', 1, '2025-08-03 09:39:12', '2025-08-03 09:39:12'),
(27, 'ORD20250803D29033', 4, 1, '2025-08-03', 450.00, 0.00, 0.00, 450.00, 'cod', 'paid', '2025-08-14', '321 ถนนเพชรบุรี', 'pending', '555', 1, '2025-08-03 09:39:12', '2025-08-03 09:39:12'),
(28, 'ORD20250803778327', 4, 1, '2025-08-03', 450.00, 0.00, 0.00, 450.00, 'cod', 'paid', '2025-08-14', '321 ถนนเพชรบุรี', 'pending', '555', 1, '2025-08-03 09:39:12', '2025-08-03 09:39:12'),
(29, 'ORD20250803908207', 4, 1, '2025-08-03', 450.00, 0.00, 0.00, 450.00, 'cod', 'paid', '2025-08-14', '321 ถนนเพชรบุรี', 'pending', '555', 1, '2025-08-03 09:39:12', '2025-08-03 09:39:12'),
(31, 'ORD20250803D25910', 1, 1, '2025-08-03', 450.00, 45.00, 10.00, 405.00, 'cod', 'paid', '2025-08-11', '123 ถนนสุขุมวิท', 'pending', 'ทดสอบว่าช้ามั้ย', 1, '2025-08-03 09:41:19', '2025-08-03 09:41:19'),
(32, 'ORD20250803A46396', 3, 1, '2025-08-03', 450.00, 0.00, 0.00, 450.00, 'transfer', 'paid', '2025-08-05', '789 ถนนลาดพร้าว', 'pending', NULL, 1, '2025-08-03 10:44:30', '2025-08-03 10:44:30'),
(34, 'ORD202508036ABD4D', 1, 3, '2025-08-03', 700.00, 0.00, 0.00, 700.00, 'cash', 'pending', '2025-08-03', '123 ถนนสุขุมวิท', 'pending', '121', 1, '2025-08-03 13:24:46', '2025-08-03 13:24:46'),
(36, 'ORD202508032D6B8E', 1, 3, '2025-08-03', 450.00, 0.00, 0.00, 450.00, 'cash', 'pending', '2025-08-03', '123 ถนนสุขุมวิท', 'delivered', '555', 1, '2025-08-03 13:36:18', '2025-08-04 16:16:39'),
(37, 'ORD20250805420131', 1, 3, '2025-08-05', 1500.00, 0.00, 0.00, 1500.00, 'cod', 'pending', '2025-08-05', '123 ถนนสุขุมวิท', 'delivered', '22', 1, '2025-08-05 08:07:49', '2025-08-05 08:08:19'),
(39, 'ORD20250805A9F387', 11, 3, '2025-08-05', 450.00, 0.00, 0.00, 450.00, 'cod', 'pending', '2025-08-05', '303 ถ.สีลม กรุงเทพฯ', 'delivered', 'กกกกกก', 1, '2025-08-05 10:07:42', '2025-08-05 11:43:40'),
(40, 'ORD202508054E87F5', 11, 3, '2025-08-05', 450.00, 0.00, 0.00, 450.00, 'cod', 'pending', '2025-08-05', '303 ถ.สีลม กรุงเทพฯ', 'pending', '2222', 1, '2025-08-05 13:55:24', '2025-08-05 13:55:24'),
(41, 'ORD2025080664A1EE', 2, 1, '2025-08-06', 1000.00, 0.00, 0.00, 1000.00, 'cash', 'pending', NULL, NULL, 'delivered', 'ทดสอบการต่อเวลาอัตโนมัติ', 1, '2025-08-06 02:08:45', '2025-08-06 02:12:52'),
(42, 'ORD20250806D52EB3', 11, 1, '2025-08-06', 1000.00, 0.00, 0.00, 1000.00, 'cash', 'pending', NULL, NULL, 'delivered', 'ทดสอบการต่อเวลาอัตโนมัติ', 1, '2025-08-06 02:09:46', '2025-08-06 02:12:44'),
(43, 'ORD20250806774711', 2, 1, '2025-08-06', 1000.00, 0.00, 0.00, 1000.00, 'cash', 'pending', NULL, NULL, 'pending', 'ทดสอบการต่อเวลาอัตโนมัติ', 1, '2025-08-06 02:29:16', '2025-08-06 02:29:16'),
(44, 'ORD2025080615C966', 11, 1, '2025-08-06', 1000.00, 0.00, 0.00, 1000.00, 'cash', 'pending', NULL, NULL, 'pending', 'Debug การต่อเวลาอัตโนมัติ', 1, '2025-08-06 02:32:32', '2025-08-06 02:32:32'),
(45, 'ORD20250806FA9C29', 11, 1, '2025-08-06', 1000.00, 0.00, 0.00, 1000.00, 'cash', 'pending', NULL, NULL, 'pending', 'ทดสอบการต่อเวลาอัตโนมัติ', 1, '2025-08-06 02:34:08', '2025-08-06 02:34:08'),
(46, 'ORD20250806931E76', 11, 1, '2025-08-06', 1000.00, 0.00, 0.00, 1000.00, 'cash', 'pending', NULL, NULL, 'pending', 'ทดสอบการต่อเวลาอัตโนมัติ', 1, '2025-08-06 02:34:16', '2025-08-06 02:34:16'),
(50, 'ORD20250806B79C15', 11, 1, '2025-08-06', 1000.00, 0.00, 0.00, 1000.00, 'cash', 'pending', NULL, NULL, 'pending', 'Debug การต่อเวลาอัตโนมัติ', 1, '2025-08-06 02:35:00', '2025-08-06 02:35:00'),
(51, 'ORD202508061EBCD7', 2, 1, '2025-08-06', 1000.00, 0.00, 0.00, 1000.00, 'cash', 'pending', NULL, NULL, 'pending', 'ทดสอบการต่อเวลาอัตโนมัติ', 1, '2025-08-06 02:35:00', '2025-08-06 02:35:00'),
(53, 'ORD20250806127C7A', 2, 1, '2025-08-06', 1000.00, 0.00, 0.00, 1000.00, 'cash', 'pending', NULL, NULL, 'pending', 'ทดสอบการต่อเวลาอัตโนมัติ', 1, '2025-08-06 02:35:17', '2025-08-06 02:35:17'),
(55, 'ORD202508069F0226', 2, 1, '2025-08-06', 1000.00, 0.00, 0.00, 1000.00, 'cash', 'pending', NULL, NULL, 'pending', 'Debug การต่อเวลาอัตโนมัติ', 1, '2025-08-06 02:35:50', '2025-08-06 02:35:50'),
(57, 'ORD20250806D1903B', 11, 1, '2025-08-06', 1000.00, 0.00, 0.00, 1000.00, 'cash', 'pending', NULL, NULL, 'pending', 'ทดสอบการต่อเวลาอัตโนมัติ', 1, '2025-08-06 02:40:08', '2025-08-06 02:40:08'),
(58, 'ORD20250806C5314E', 2, 1, '2025-08-06', 1000.00, 0.00, 0.00, 1000.00, 'cash', 'pending', NULL, NULL, 'pending', 'Debug การต่อเวลาอัตโนมัติ', 1, '2025-08-06 02:46:04', '2025-08-06 02:46:04'),
(59, 'ORD202508066D5DA2', 2, 1, '2025-08-06', 1000.00, 0.00, 0.00, 1000.00, 'cash', 'pending', NULL, NULL, 'pending', 'ทดสอบการต่อเวลาอัตโนมัติ', 1, '2025-08-06 02:46:09', '2025-08-06 02:46:09'),
(60, 'ORD20250806A4C050', 11, 3, '2025-08-06', 600.00, 0.00, 0.00, 600.00, 'cash', 'pending', '2025-08-06', '303 ถ.สีลม กรุงเทพฯ', 'pending', 'ทดสอบ', 1, '2025-08-06 02:48:36', '2025-08-06 02:48:36'),
(61, 'ORD20250806E19365', 11, 1, '2025-08-06', 1000.00, 0.00, 0.00, 1000.00, 'cash', 'pending', NULL, NULL, 'pending', 'ทดสอบการต่อเวลาอัตโนมัติ', 1, '2025-08-06 02:50:50', '2025-08-06 02:50:50'),
(63, 'ORD202508066B682D', 11, 1, '2025-08-06', 1000.00, 0.00, 0.00, 1000.00, 'cash', 'pending', NULL, NULL, 'pending', 'ทดสอบการต่อเวลาอัตโนมัติ', 1, '2025-08-06 02:51:07', '2025-08-06 02:51:07'),
(64, 'ORD202508064A8E5E', 2, 1, '2025-08-06', 1000.00, 0.00, 0.00, 1000.00, 'cash', 'pending', NULL, NULL, 'pending', 'ทดสอบการต่อเวลาอัตโนมัติ', 1, '2025-08-06 02:51:57', '2025-08-06 02:51:57'),
(65, 'ORD202508068DF9EE', 2, 1, '2025-08-06', 1000.00, 0.00, 0.00, 1000.00, 'cash', 'pending', NULL, NULL, 'pending', 'ทดสอบการต่อเวลาอัตโนมัติ', 1, '2025-08-06 02:52:05', '2025-08-06 02:52:05'),
(67, 'ORD20250806B77AF3', 11, 1, '2025-08-06', 1000.00, 0.00, 0.00, 1000.00, 'cash', 'pending', NULL, NULL, 'pending', 'ทดสอบการแก้ไขปัญหาสุดท้าย', 1, '2025-08-06 02:56:49', '2025-08-06 02:56:49'),
(68, 'ORD20250806EA0BC8', 5, 1, '2025-08-06', 1000.00, 0.00, 0.00, 1000.00, 'cash', 'pending', NULL, NULL, 'pending', 'ทดสอบการต่อเวลาอัตโนมัติ', 1, '2025-08-06 03:34:45', '2025-08-06 03:34:45'),
(69, 'ORD202508066FE816', 1, 1, '2025-08-06', 1000.00, 0.00, 0.00, 1000.00, 'cash', 'pending', NULL, NULL, 'pending', 'ทดสอบการต่อเวลาอัตโนมัติ', 1, '2025-08-06 03:38:51', '2025-08-06 03:38:51'),
(70, 'ORD202508060C03B8', 1, 1, '2025-08-06', 1000.00, 0.00, 0.00, 1000.00, 'cash', 'pending', NULL, NULL, 'pending', 'ทดสอบการต่อเวลาอัตโนมัติ', 1, '2025-08-06 03:39:41', '2025-08-06 03:39:41'),
(71, 'ORD20250806144200', 1, 1, '2025-08-06', 1000.00, 0.00, 0.00, 1000.00, 'cash', 'pending', NULL, NULL, 'pending', 'ทดสอบการต่อเวลาอัตโนมัติ', 1, '2025-08-06 03:40:31', '2025-08-06 03:40:31'),
(72, 'ORD202508069F7EA5', 1, 1, '2025-08-06', 1000.00, 0.00, 0.00, 1000.00, 'cash', 'pending', NULL, NULL, 'pending', 'ทดสอบการต่อเวลาอัตโนมัติ', 1, '2025-08-06 03:41:41', '2025-08-06 03:41:41'),
(73, 'ORD20250806042A83', 1, 1, '2025-08-06', 1000.00, 0.00, 0.00, 1000.00, 'cash', 'pending', NULL, NULL, 'pending', 'ทดสอบการต่อเวลาอัตโนมัติ', 1, '2025-08-06 03:42:31', '2025-08-06 03:42:31'),
(77, 'ORD2025080676BF03', 1, 1, '2025-08-06', 1000.00, 0.00, 0.00, 1000.00, 'cash', 'pending', NULL, NULL, 'pending', 'ทดสอบการต่อเวลาอัตโนมัติ', 1, '2025-08-06 03:42:31', '2025-08-06 03:42:31'),
(78, 'ORD20250806A3558E', 1, 1, '2025-08-06', 1000.00, 0.00, 0.00, 1000.00, 'cash', 'pending', NULL, NULL, 'pending', 'ทดสอบการต่อเวลาอัตโนมัติ', 1, '2025-08-06 03:45:27', '2025-08-06 03:45:27'),
(79, 'ORD202508069E66B5', 1, 1, '2025-08-06', 1000.00, 0.00, 0.00, 1000.00, 'cash', 'pending', NULL, NULL, 'pending', 'ทดสอบการต่อเวลาอัตโนมัติ', 1, '2025-08-06 04:14:37', '2025-08-06 04:14:37'),
(80, 'ORD202508064FA65C', 1, 1, '2025-08-06', 1000.00, 0.00, 0.00, 1000.00, 'cash', 'pending', NULL, NULL, 'pending', 'ทดสอบการต่อเวลาอัตโนมัติ', 1, '2025-08-06 04:14:55', '2025-08-06 04:14:55'),
(81, 'ORD202508062FB0BB', 1, 1, '2025-08-06', 1000.00, 0.00, 0.00, 1000.00, 'cash', 'pending', NULL, NULL, 'pending', 'ทดสอบการต่อเวลาอัตโนมัติ', 1, '2025-08-06 04:14:56', '2025-08-06 04:14:56'),
(82, 'ORD2025080658DBEC', 1, 1, '2025-08-06', 1000.00, 0.00, 0.00, 1000.00, 'cash', 'pending', NULL, NULL, 'pending', 'ทดสอบการต่อเวลาอัตโนมัติ', 1, '2025-08-06 04:14:57', '2025-08-06 04:14:57'),
(83, 'ORD20250806701140', 1, 1, '2025-08-06', 1000.00, 0.00, 0.00, 1000.00, 'cash', 'pending', NULL, NULL, 'pending', 'ทดสอบการต่อเวลาอัตโนมัติ', 1, '2025-08-06 04:14:58', '2025-08-06 04:14:58'),
(84, 'ORD20250806932C68', 1, 1, '2025-08-06', 1000.00, 0.00, 0.00, 1000.00, 'cash', 'pending', NULL, NULL, 'pending', 'ทดสอบการต่อเวลาอัตโนมัติ', 1, '2025-08-06 04:14:58', '2025-08-06 04:14:58'),
(85, 'ORD20250806C0DD47', 1, 1, '2025-08-06', 1000.00, 0.00, 0.00, 1000.00, 'cash', 'pending', NULL, NULL, 'pending', 'ทดสอบการต่อเวลาอัตโนมัติ', 1, '2025-08-06 04:14:59', '2025-08-06 04:14:59'),
(86, 'ORD20250806C44D2F', 1, 1, '2025-08-06', 1000.00, 0.00, 0.00, 1000.00, 'cash', 'pending', NULL, NULL, 'pending', 'ทดสอบการต่อเวลาอัตโนมัติ', 1, '2025-08-06 04:15:00', '2025-08-06 04:15:00'),
(87, 'ORD20250806C601FA', 1, 1, '2025-08-06', 1000.00, 0.00, 0.00, 1000.00, 'cash', 'pending', NULL, NULL, 'pending', 'ทดสอบการต่อเวลาอัตโนมัติ', 1, '2025-08-06 04:15:00', '2025-08-06 04:15:00'),
(88, 'ORD20250806EF1735', 1, 1, '2025-08-06', 1000.00, 0.00, 0.00, 1000.00, 'cash', 'pending', NULL, NULL, 'pending', 'ทดสอบการต่อเวลาอัตโนมัติ', 1, '2025-08-06 04:15:01', '2025-08-06 04:15:01'),
(89, 'ORD202508062B9B9C', 1, 1, '2025-08-06', 1000.00, 0.00, 0.00, 1000.00, 'cash', 'pending', NULL, NULL, 'pending', 'ทดสอบการต่อเวลาอัตโนมัติ', 1, '2025-08-06 04:15:01', '2025-08-06 04:15:01'),
(90, 'ORD202508060E4307', 1, 1, '2025-08-06', 1000.00, 0.00, 0.00, 1000.00, 'cash', 'pending', NULL, NULL, 'pending', 'ทดสอบการต่อเวลาอัตโนมัติ', 1, '2025-08-06 04:15:02', '2025-08-06 04:15:02'),
(91, 'ORD2025080665FB2A', 1, 1, '2025-08-06', 1000.00, 0.00, 0.00, 1000.00, 'cash', 'pending', NULL, NULL, 'pending', 'ทดสอบการต่อเวลาอัตโนมัติ', 1, '2025-08-06 04:15:02', '2025-08-06 04:15:02'),
(92, 'ORD20250806198CB3', 1, 1, '2025-08-06', 1000.00, 0.00, 0.00, 1000.00, 'cash', 'pending', NULL, NULL, 'pending', 'ทดสอบการต่อเวลาอัตโนมัติ', 1, '2025-08-06 04:15:03', '2025-08-06 04:15:03'),
(93, 'ORD20250806FD9681', 1, 1, '2025-08-06', 1000.00, 0.00, 0.00, 1000.00, 'cash', 'pending', NULL, NULL, 'pending', 'ทดสอบการต่อเวลาอัตโนมัติ', 1, '2025-08-06 04:15:03', '2025-08-06 04:15:03'),
(94, 'ORD2025080608513A', 1, 1, '2025-08-06', 1000.00, 0.00, 0.00, 1000.00, 'cash', 'pending', NULL, NULL, 'pending', 'ทดสอบการต่อเวลาอัตโนมัติ', 1, '2025-08-06 04:15:04', '2025-08-06 04:15:04'),
(95, 'ORD202508061999E4', 1, 1, '2025-08-06', 1000.00, 0.00, 0.00, 1000.00, 'cash', 'pending', NULL, NULL, 'pending', 'ทดสอบการต่อเวลาอัตโนมัติ', 1, '2025-08-06 04:15:04', '2025-08-06 04:15:04'),
(96, 'ORD20250806836F7A', 1, 1, '2025-08-06', 1000.00, 0.00, 0.00, 1000.00, 'cash', 'pending', NULL, NULL, 'pending', 'ทดสอบการต่อเวลาอัตโนมัติ', 1, '2025-08-06 04:15:05', '2025-08-06 04:15:05'),
(97, 'ORD202508062D2502', 1, 1, '2025-08-06', 1000.00, 0.00, 0.00, 1000.00, 'cash', 'pending', NULL, NULL, 'pending', 'ทดสอบการต่อเวลาอัตโนมัติ', 1, '2025-08-06 04:15:05', '2025-08-06 04:15:05'),
(98, 'ORD202508061F6739', 1, 1, '2025-08-06', 1000.00, 0.00, 0.00, 1000.00, 'cash', 'pending', NULL, NULL, 'pending', 'ทดสอบการต่อเวลาอัตโนมัติ', 1, '2025-08-06 04:15:06', '2025-08-06 04:15:06'),
(99, 'ORD202508062886A7', 1, 1, '2025-08-06', 1000.00, 0.00, 0.00, 1000.00, 'cash', 'pending', NULL, NULL, 'pending', 'ทดสอบการต่อเวลาอัตโนมัติ', 1, '2025-08-06 04:15:06', '2025-08-06 04:15:06'),
(100, 'ORD20250806FD6C9A', 1, 1, '2025-08-06', 1000.00, 0.00, 0.00, 1000.00, 'cash', 'pending', NULL, NULL, 'pending', 'ทดสอบการต่อเวลาอัตโนมัติ', 1, '2025-08-06 04:15:07', '2025-08-06 04:15:07'),
(101, 'ORD2025080689F1F8', 1, 1, '2025-08-06', 1000.00, 0.00, 0.00, 1000.00, 'cash', 'pending', NULL, NULL, 'pending', 'ทดสอบการต่อเวลาอัตโนมัติ', 1, '2025-08-06 04:15:08', '2025-08-06 04:15:08'),
(102, 'ORD20250806BE778E', 1, 1, '2025-08-06', 1000.00, 0.00, 0.00, 1000.00, 'cash', 'pending', NULL, NULL, 'pending', 'ทดสอบการต่อเวลาอัตโนมัติ', 1, '2025-08-06 04:15:08', '2025-08-06 04:15:08'),
(103, 'ORD2025080689293E', 1, 1, '2025-08-06', 1000.00, 0.00, 0.00, 1000.00, 'cash', 'pending', NULL, NULL, 'pending', 'ทดสอบการต่อเวลาอัตโนมัติ', 1, '2025-08-06 04:15:08', '2025-08-06 04:15:08'),
(104, 'ORD20250806CDEFA7', 1, 1, '2025-08-06', 1000.00, 0.00, 0.00, 1000.00, 'cash', 'pending', NULL, NULL, 'pending', 'ทดสอบการต่อเวลาอัตโนมัติ', 1, '2025-08-06 04:15:09', '2025-08-06 04:15:09'),
(105, 'ORD20250806854565', 1, 1, '2025-08-06', 1000.00, 0.00, 0.00, 1000.00, 'cash', 'pending', NULL, NULL, 'pending', 'ทดสอบการต่อเวลาอัตโนมัติ', 1, '2025-08-06 04:15:09', '2025-08-06 04:15:09'),
(106, 'ORD20250806B75ECD', 1, 1, '2025-08-06', 1000.00, 0.00, 0.00, 1000.00, 'cash', 'pending', NULL, NULL, 'pending', 'ทดสอบการต่อเวลาอัตโนมัติ', 1, '2025-08-06 04:15:10', '2025-08-06 04:15:10'),
(107, 'ORD20250806836BCC', 1, 1, '2025-08-06', 1000.00, 0.00, 0.00, 1000.00, 'cash', 'pending', NULL, NULL, 'pending', 'ทดสอบการต่อเวลาอัตโนมัติ', 1, '2025-08-06 04:15:10', '2025-08-06 04:15:10'),
(108, 'ORD2025080616E69D', 1, 1, '2025-08-06', 1000.00, 0.00, 0.00, 1000.00, 'cash', 'pending', NULL, NULL, 'pending', 'ทดสอบการต่อเวลาอัตโนมัติ', 1, '2025-08-06 04:15:11', '2025-08-06 04:15:11'),
(109, 'ORD202508062E328F', 1, 1, '2025-08-06', 1000.00, 0.00, 0.00, 1000.00, 'cash', 'pending', NULL, NULL, 'pending', 'ทดสอบการต่อเวลาอัตโนมัติ', 1, '2025-08-06 04:15:11', '2025-08-06 04:15:11'),
(110, 'ORD20250806BD17F4', 1, 1, '2025-08-06', 1000.00, 0.00, 0.00, 1000.00, 'cash', 'pending', NULL, NULL, 'pending', 'ทดสอบการต่อเวลาอัตโนมัติ', 1, '2025-08-06 04:15:12', '2025-08-06 04:15:12'),
(111, 'ORD2025080668DE15', 1, 1, '2025-08-06', 1000.00, 0.00, 0.00, 1000.00, 'cash', 'pending', NULL, NULL, 'pending', 'ทดสอบการต่อเวลาอัตโนมัติ', 1, '2025-08-06 04:15:12', '2025-08-06 04:15:12'),
(112, 'ORD202508068D21D4', 1, 1, '2025-08-06', 1000.00, 0.00, 0.00, 1000.00, 'cash', 'pending', NULL, NULL, 'pending', 'ทดสอบการต่อเวลาอัตโนมัติ', 1, '2025-08-06 04:15:13', '2025-08-06 04:15:13'),
(113, 'ORD20250806F8840D', 1, 1, '2025-08-06', 1000.00, 0.00, 0.00, 1000.00, 'cash', 'pending', NULL, NULL, 'pending', 'ทดสอบการต่อเวลาอัตโนมัติ', 1, '2025-08-06 04:17:35', '2025-08-06 04:17:35'),
(114, 'ORD202508061427B9', 1, 1, '2025-08-06', 1000.00, 0.00, 0.00, 1000.00, 'cash', 'pending', NULL, NULL, 'pending', 'ทดสอบการต่อเวลาอัตโนมัติ', 1, '2025-08-06 04:20:00', '2025-08-06 04:20:00'),
(115, 'ORD202508062541A7', 1, 1, '2025-08-06', 1000.00, 0.00, 0.00, 1000.00, 'cash', 'pending', NULL, NULL, 'pending', 'ทดสอบการต่อเวลาอัตโนมัติ', 1, '2025-08-06 04:21:41', '2025-08-06 04:21:41'),
(116, 'ORD202508066A6889', 1, 1, '2025-08-06', 1000.00, 0.00, 0.00, 1000.00, 'cash', 'pending', NULL, NULL, 'pending', 'ทดสอบการจำกัดเวลา 90 วัน', 1, '2025-08-06 04:27:06', '2025-08-06 04:27:06'),
(117, 'ORD20250806284AFB', 11, 3, '2025-08-06', 450.00, 0.00, 0.00, 450.00, 'cash', 'pending', '2025-08-06', '303 ถ.สีลม กรุงเทพฯ', 'pending', 'ก', 1, '2025-08-06 04:28:50', '2025-08-06 04:28:50'),
(118, 'ORD20250806C07E67', 6, 3, '2025-08-06', 450.00, 0.00, 0.00, 450.00, 'cash', 'pending', '2025-08-06', '123 ถ.สุขุมวิท กรุงเทพฯ', 'pending', '111', 1, '2025-08-06 04:31:19', '2025-08-06 04:31:19');

--
-- Indexes for dumped tables
--

--
-- Indexes for table `orders`
--
ALTER TABLE `orders`
  ADD PRIMARY KEY (`order_id`),
  ADD UNIQUE KEY `order_number` (`order_number`),
  ADD KEY `idx_order_number` (`order_number`),
  ADD KEY `idx_customer_id` (`customer_id`),
  ADD KEY `idx_created_by` (`created_by`),
  ADD KEY `idx_order_date` (`order_date`),
  ADD KEY `idx_payment_status` (`payment_status`),
  ADD KEY `idx_delivery_status` (`delivery_status`),
  ADD KEY `idx_orders_customer_id` (`customer_id`),
  ADD KEY `idx_orders_created_by` (`created_by`),
  ADD KEY `idx_orders_order_date` (`order_date`),
  ADD KEY `idx_orders_payment_status` (`payment_status`),
  ADD KEY `idx_orders_delivery_status` (`delivery_status`),
  ADD KEY `idx_orders_created_at` (`created_at`);

--
-- AUTO_INCREMENT for dumped tables
--

--
-- AUTO_INCREMENT for table `orders`
--
ALTER TABLE `orders`
  MODIFY `order_id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=119;

--
-- Constraints for dumped tables
--

--
-- Constraints for table `orders`
--
ALTER TABLE `orders`
  ADD CONSTRAINT `orders_ibfk_1` FOREIGN KEY (`customer_id`) REFERENCES `customers` (`customer_id`),
  ADD CONSTRAINT `orders_ibfk_2` FOREIGN KEY (`created_by`) REFERENCES `users` (`user_id`);
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
